In [25]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split
from sklearn import metrics
# Read in data and display first 5 rows
tabel = pd.read_csv('suhu.csv')
tabel.head(5)

   Unnamed: 0  hari  minggu  suhu2  suhu1  rata-rata  actual  teman
0           0     1   senin     45     45       45.6      45     29
1           1     2  selasa     44     45       45.7      44     61
2           2     3    rabu     45     44       45.8      41     56
3           3     4    kami     44     41       45.9      40     53
4           4     5   jumat     41     40       46.1      44     41

In [26]:
tabel.shape

(5, 8)

In [27]:
tabel.describe()

,Unnamed: 0,hari,suhu2,suhu1,rata-rata,actual,teman
count,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000
mean,2.000000,3.000000,43.800000,43.000000,45.820000,42.800000,48.000000
std,1.581139,1.581139,1.643168,2.345208,0.192354,2.167948,12.922848
min,0.000000,1.000000,41.000000,40.000000,45.600000,40.000000,29.000000
25%,1.000000,2.000000,44.000000,41.000000,45.700000,41.000000,41.000000
50%,2.000000,3.000000,44.000000,44.000000,45.800000,44.000000,53.000000
75%,3.000000,4.000000,45.000000,45.000000,45.900000,44.000000,56.000000
max,4.000000,5.000000,45.000000,45.000000,46.100000,45.000000,61.000000

In [28]:
tabel = pd.get_dummies(tabel)
tabel.iloc[:,5:].head(5)

,actual,teman,minggu_jumat,minggu_kami,minggu_rabu,minggu_selasa,minggu_senin
0,45,29,0,0,0,0,1
1,44,61,0,0,0,1,0
2,41,56,0,0,1,0,0
3,40,53,0,1,0,0,0
4,44,41,1,0,0,0,0

In [29]:
X = tabel.iloc[:, :-1].values
y = tabel.iloc[:, 1].values

In [35]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.2, random_state=4)

In [36]:
clf = RandomForestClassifier()
clf.fit(X_train, y_train)

RandomForestClassifier()

In [37]:
y_pred = clf.predict (X_test)

In [38]:
y_pred

array([2], dtype=int64)

In [39]:
clf.predict(X)

array([2, 2, 3, 4, 5], dtype=int64)